@kuba-mazurkiewicz yes, sorry for the slow response. Tested and confirmed good for both types of advanced attributes.
```

cat ./data/network_access.nac.yaml 
---
ise:
  network_access:
    policy_elements:
      authorization_profiles:
        - name: AUTHZ_01
          description: Authorization profile for iPSK
          access_type: ACCESS_ACCEPT
          advanced_attributes:
            - name: Cisco:cisco-av-pair
              value: psk-mode=ascii
            - name: Cisco:cisco-av-pair
              value: psk=Password123
        - name: AUTHZ_02
          description: Authorization profile for Device Admin
          access_type: ACCESS_ACCEPT
          advanced_attributes:
            - name: Cisco:cisco-av-pair
              value: shell:priv-lvl=15


terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ise.ise_authorization_profile.authorization_profile["AUTHZ_01"] will be created
  + resource "ise_authorization_profile" "authorization_profile" {
      + access_type                 = "ACCESS_ACCEPT"
      + advanced_attributes         = [
          + {
              + attribute_left_dictionary_name = "Cisco"
              + attribute_left_name            = "cisco-av-pair"
              + attribute_right_value          = "psk-mode=ascii"
              + attribute_right_value_type     = "AttributeValue"
            },
          + {
              + attribute_left_dictionary_name = "Cisco"
              + attribute_left_name            = "cisco-av-pair"
              + attribute_right_value          = "psk=Password123"
              + attribute_right_value_type     = "AttributeValue"
            },
        ]
      + agentless_posture           = false
      + description                 = "Authorization profile for iPSK"
      + easywired_session_candidate = false
      + id                          = (known after apply)
      + name                        = "AUTHZ_01"
      + neat                        = false
      + profile_name                = "Cisco"
      + service_template            = false
      + track_movement              = false
      + voice_domain_permission     = false
      + web_auth                    = false
    }

  # module.ise.ise_authorization_profile.authorization_profile["AUTHZ_02"] will be created
  + resource "ise_authorization_profile" "authorization_profile" {
      + access_type                 = "ACCESS_ACCEPT"
      + advanced_attributes         = [
          + {
              + attribute_left_dictionary_name = "Cisco"
              + attribute_left_name            = "cisco-av-pair"
              + attribute_right_value          = "shell:priv-lvl=15"
              + attribute_right_value_type     = "AttributeValue"
            },
        ]
      + agentless_posture           = false
      + description                 = "Authorization profile for Device Admin"
      + easywired_session_candidate = false
      + id                          = (known after apply)
      + name                        = "AUTHZ_02"
      + neat                        = false
      + profile_name                = "Cisco"
      + service_template            = false
      + track_movement              = false
      + voice_domain_permission     = false
      + web_auth                    = false
    }

  # module.ise.local_sensitive_file.defaults[0] will be created
  + resource "local_sensitive_file" "defaults" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "defaults.yaml"
      + id                   = (known after apply)
    }

  # module.ise.terraform_data.validation will be created
  + resource "terraform_data" "validation" {
      + id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.ise.terraform_data.validation: Creating...
module.ise.terraform_data.validation: Creation complete after 0s [id=ec96e7a8-486b-a4cf-c7f8-8573fb755b6a]
module.ise.local_sensitive_file.defaults[0]: Creating...
module.ise.local_sensitive_file.defaults[0]: Creation complete after 0s [id=a238b3652e831587242a309f5d28beaf863a846a]
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_02"]: Creating...
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_01"]: Creating...
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_02"]: Creation complete after 1s [id=e9129af0-ad8d-11f0-a6e3-005056bfaff7]
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_01"]: Creation complete after 1s [id=e911b090-ad8d-11f0-a6e3-005056bfaff7]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

terraform plan

module.ise.terraform_data.validation: Refreshing state... [id=ec96e7a8-486b-a4cf-c7f8-8573fb755b6a]
module.ise.local_sensitive_file.defaults[0]: Refreshing state... [id=a238b3652e831587242a309f5d28beaf863a846a]
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_02"]: Refreshing state... [id=e9129af0-ad8d-11f0-a6e3-005056bfaff7]
module.ise.ise_authorization_profile.authorization_profile["AUTHZ_01"]: Refreshing state... [id=e911b090-ad8d-11f0-a6e3-005056bfaff7]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

```